backend/app/controllers/api/v1/sticky_notes_controller.rb

SELECT "sticky_notes".* FROM "sticky_notes" WHERE "sticky_notes"."whiteboard_id" = ?  [["whiteboard_id", "default"]]
---
  def index
    sticky_notes = StickyNote.where(whiteboard_id: @whiteboard_id)

INSERT INTO "sticky_notes" ("whiteboard_id", "text", "x", "y", "color", "width", "height", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    sticky_note = StickyNote.new(sticky_note_params.merge(whiteboard_id: @whiteboard_id))

    if sticky_note.save

UPDATE "sticky_notes" SET "text" = ?, "updated_at" = ? WHERE "sticky_notes"."id" = ?  [["text", "Updated note"], ["updated_at", "2025-06-07 14:19:05.158920"], ["id", 980190963]]
---
  def update
    if @sticky_note.update(sticky_note_params)

DELETE FROM "sticky_notes" WHERE "sticky_notes"."id" = ?  [["id", 980190963]]
---
  def destroy
    @sticky_note.destroy

SELECT "sticky_notes".* FROM "sticky_notes" WHERE "sticky_notes"."id" = ? LIMIT ?  [["id", 980190963], ["LIMIT", 1]]
---
  def set_sticky_note
    @sticky_note = StickyNote.find(params[:id])